<?php

create_options_page(
	'Шапка',
	'opt-header'
);


create_fields(
	'Шапка',
	'opt-header',
	[
		add_field_hint(
			'header_hint',
			'<b>Логотип</b> - перейдите на Настройки сайта > Основные настройки > Логотип сайта.<br/><b>Меню</b> - перейдите на Настройки сайта > Меню > Меню шапки.<br/><b>Контактные данные</b> - перейдите на Настройки сайта > Секции > Основные секции > Контактные данные',
			'Логотип, меню и контактные данные'
		),
		add_field_group(
			'header_btn',
			'Кнопка',
			[
				add_field_link(
					'ru',
					'Ru',
				),
				add_field_link(
					'en',
					'En',
				),
			]
		)

	]
);